Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/pio/pic32cz8110ca80208.h
#define PIN_PC17G_BSDAP_TDI                        _UINT32_(81)
#define MUX_PC17G_BSDAP_TDI                        _UINT32_(6) 
#define PINMUX_PC17G_BSDAP_TDI                     ((PIN_PC17G_BSDAP_TDI << 16) | MUX_PC17G_BSDAP_TDI)
#define PORT_PC17G_BSDAP_TDI                       (_UINT32_(1) << 17)

#define PIN_PC19G_BSDAP_TDO                        _UINT32_(83)
#define MUX_PC19G_BSDAP_TDO                        _UINT32_(6) 
#define PINMUX_PC19G_BSDAP_TDO                     ((PIN_PC19G_BSDAP_TDO << 16) | MUX_PC19G_BSDAP_TDO)
#define PORT_PC19G_BSDAP_TDO                       (_UINT32_(1) << 19)

#define PIN_PC18G_BSDAP_TMS_SWDIO                  _UINT32_(82)
#define MUX_PC18G_BSDAP_TMS_SWDIO                  _UINT32_(6) 
#define PINMUX_PC18G_BSDAP_TMS_SWDIO               ((PIN_PC18G_BSDAP_TMS_SWDIO << 16) | MUX_PC18G_BSDAP_TMS_SWDIO)
#define PORT_PC18G_BSDAP_TMS_SWDIO                 (_UINT32_(1) << 18)

/* ========== PORT definition for CAN0 peripheral ========== */
#define PIN_PC04H_CAN0_RX                          _UINT32_(68)
#define MUX_PC04H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC04H_CAN0_RX                       ((PIN_PC04H_CAN0_RX << 16) | MUX_PC04H_CAN0_RX)
#define PORT_PC04H_CAN0_RX                         (_UINT32_(1) << 4)

#define PIN_PC19H_CAN0_RX                          _UINT32_(83)
#define MUX_PC19H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC19H_CAN0_RX                       ((PIN_PC19H_CAN0_RX << 16) | MUX_PC19H_CAN0_RX)
#define PORT_PC19H_CAN0_RX                         (_UINT32_(1) << 19)

#define PIN_PC05H_CAN0_TX                          _UINT32_(69)
#define MUX_PC05H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC05H_CAN0_TX                       ((PIN_PC05H_CAN0_TX << 16) | MUX_PC05H_CAN0_TX)
#define PORT_PC05H_CAN0_TX                         (_UINT32_(1) << 5)

#define PIN_PC20H_CAN0_TX                          _UINT32_(84)
#define MUX_PC20H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC20H_CAN0_TX                       ((PIN_PC20H_CAN0_TX << 16) | MUX_PC20H_CAN0_TX)
#define PORT_PC20H_CAN0_TX                         (_UINT32_(1) << 20)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PC06H_CAN1_RX                          _UINT32_(70)
#define MUX_PC06H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_RX                       ((PIN_PC06H_CAN1_RX << 16) | MUX_PC06H_CAN1_RX)
#define PORT_PC06H_CAN1_RX                         (_UINT32_(1) << 6)

#define PIN_PD08H_CAN1_RX                          _UINT32_(104)
#define MUX_PD08H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PD08H_CAN1_RX                       ((PIN_PD08H_CAN1_RX << 16) | MUX_PD08H_CAN1_RX)
#define PORT_PD08H_CAN1_RX                         (_UINT32_(1) << 8)

#define PIN_PC07H_CAN1_TX                          _UINT32_(71)
#define MUX_PC07H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC07H_CAN1_TX                       ((PIN_PC07H_CAN1_TX << 16) | MUX_PC07H_CAN1_TX)
#define PORT_PC07H_CAN1_TX                         (_UINT32_(1) << 7)

#define PIN_PD09H_CAN1_TX                          _UINT32_(105)
#define MUX_PD09H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD09H_CAN1_TX                       ((PIN_PD09H_CAN1_TX << 16) | MUX_PD09H_CAN1_TX)
#define PORT_PD09H_CAN1_TX                         (_UINT32_(1) << 9)

/* ========== PORT definition for CAN2 peripheral ========== */
#define PIN_PC25H_CAN2_RX                          _UINT32_(89)
#define MUX_PC25H_CAN2_RX                          _UINT32_(7) 
#define PINMUX_PC25H_CAN2_RX                       ((PIN_PC25H_CAN2_RX << 16) | MUX_PC25H_CAN2_RX)
#define PORT_PC25H_CAN2_RX                         (_UINT32_(1) << 25)

#define PIN_PC26H_CAN2_TX                          _UINT32_(90)
#define MUX_PC26H_CAN2_TX                          _UINT32_(7) 
#define PINMUX_PC26H_CAN2_TX                       ((PIN_PC26H_CAN2_TX << 16) | MUX_PC26H_CAN2_TX)
#define PORT_PC26H_CAN2_TX                         (_UINT32_(1) << 26)

/* ========== PORT definition for CAN3 peripheral ========== */
#define PIN_PC29H_CAN3_RX                          _UINT32_(93)
#define MUX_PC29H_CAN3_RX                          _UINT32_(7) 
#define PINMUX_PC29H_CAN3_RX                       ((PIN_PC29H_CAN3_RX << 16) | MUX_PC29H_CAN3_RX)
#define PORT_PC29H_CAN3_RX                         (_UINT32_(1) << 29)

#define PIN_PD13H_CAN3_TX                          _UINT32_(109)
#define MUX_PD13H_CAN3_TX                          _UINT32_(7) 
#define PINMUX_PD13H_CAN3_TX                       ((PIN_PD13H_CAN3_TX << 16) | MUX_PD13H_CAN3_TX)
#define PORT_PD13H_CAN3_TX                         (_UINT32_(1) << 13)

/* ========== PORT definition for CAN4 peripheral ========== */
#define PIN_PA30H_CAN4_RX                          _UINT32_(30)
#define MUX_PA30H_CAN4_RX                          _UINT32_(7) 
#define PINMUX_PA30H_CAN4_RX                       ((PIN_PA30H_CAN4_RX << 16) | MUX_PA30H_CAN4_RX)
#define PORT_PA30H_CAN4_RX                         (_UINT32_(1) << 30)

#define PIN_PA31H_CAN4_TX                          _UINT32_(31)
#define MUX_PA31H_CAN4_TX                          _UINT32_(7) 
#define PINMUX_PA31H_CAN4_TX                       ((PIN_PA31H_CAN4_TX << 16) | MUX_PA31H_CAN4_TX)
#define PORT_PA31H_CAN4_TX                         (_UINT32_(1) << 31)

/* ========== PORT definition for CAN5 peripheral ========== */
#define PIN_PD23H_CAN5_RX                          _UINT32_(119)
#define MUX_PD23H_CAN5_RX                          _UINT32_(7) 
#define PINMUX_PD23H_CAN5_RX                       ((PIN_PD23H_CAN5_RX << 16) | MUX_PD23H_CAN5_RX)
#define PORT_PD23H_CAN5_RX                         (_UINT32_(1) << 23)

#define PIN_PA21H_CAN5_TX                          _UINT32_(21)
#define MUX_PA21H_CAN5_TX                          _UINT32_(7) 
#define PINMUX_PA21H_CAN5_TX                       ((PIN_PA21H_CAN5_TX << 16) | MUX_PA21H_CAN5_TX)
#define PORT_PA21H_CAN5_TX                         (_UINT32_(1) << 21)

