Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/pio/pic32cz8110ca80208.h
#define PIN_PF06A_EIC_EXTINT6                      _UINT32_(166)
#define MUX_PF06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PF06A_EIC_EXTINT6                   ((PIN_PF06A_EIC_EXTINT6 << 16) | MUX_PF06A_EIC_EXTINT6)
#define PORT_PF06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PF06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PF06 External Interrupt Line */

#define PIN_PG06A_EIC_EXTINT6                      _UINT32_(198)
#define MUX_PG06A_EIC_EXTINT6                      _UINT32_(0) 
#define PINMUX_PG06A_EIC_EXTINT6                   ((PIN_PG06A_EIC_EXTINT6 << 16) | MUX_PG06A_EIC_EXTINT6)
#define PORT_PG06A_EIC_EXTINT6                     (_UINT32_(1) << 6)
#define PIN_PG06A_EIC_EXTINT_NUM                   _UINT32_(6)  /* EIC signal: PIN_PG06 External Interrupt Line */

#define PIN_PA07A_EIC_EXTINT7                      _UINT32_(7) 
#define MUX_PA07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PA07A_EIC_EXTINT7                   ((PIN_PA07A_EIC_EXTINT7 << 16) | MUX_PA07A_EIC_EXTINT7)
#define PORT_PA07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PA07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PA07 External Interrupt Line */

#define PIN_PA23A_EIC_EXTINT7                      _UINT32_(23)
#define MUX_PA23A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PA23A_EIC_EXTINT7                   ((PIN_PA23A_EIC_EXTINT7 << 16) | MUX_PA23A_EIC_EXTINT7)
#define PORT_PA23A_EIC_EXTINT7                     (_UINT32_(1) << 23)
#define PIN_PA23A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PA23 External Interrupt Line */

#define PIN_PB07A_EIC_EXTINT7                      _UINT32_(39)
#define MUX_PB07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PB07A_EIC_EXTINT7                   ((PIN_PB07A_EIC_EXTINT7 << 16) | MUX_PB07A_EIC_EXTINT7)
#define PORT_PB07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PB07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PB07 External Interrupt Line */

#define PIN_PB23A_EIC_EXTINT7                      _UINT32_(55)
#define MUX_PB23A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PB23A_EIC_EXTINT7                   ((PIN_PB23A_EIC_EXTINT7 << 16) | MUX_PB23A_EIC_EXTINT7)
#define PORT_PB23A_EIC_EXTINT7                     (_UINT32_(1) << 23)
#define PIN_PB23A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PB23 External Interrupt Line */

#define PIN_PC07A_EIC_EXTINT7                      _UINT32_(71)
#define MUX_PC07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PC07A_EIC_EXTINT7                   ((PIN_PC07A_EIC_EXTINT7 << 16) | MUX_PC07A_EIC_EXTINT7)
#define PORT_PC07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PC07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PC07 External Interrupt Line */

#define PIN_PC23A_EIC_EXTINT7                      _UINT32_(87)
#define MUX_PC23A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PC23A_EIC_EXTINT7                   ((PIN_PC23A_EIC_EXTINT7 << 16) | MUX_PC23A_EIC_EXTINT7)
#define PORT_PC23A_EIC_EXTINT7                     (_UINT32_(1) << 23)
#define PIN_PC23A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PC23 External Interrupt Line */

#define PIN_PD07A_EIC_EXTINT7                      _UINT32_(103)
#define MUX_PD07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PD07A_EIC_EXTINT7                   ((PIN_PD07A_EIC_EXTINT7 << 16) | MUX_PD07A_EIC_EXTINT7)
#define PORT_PD07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PD07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PD07 External Interrupt Line */

#define PIN_PD23A_EIC_EXTINT7                      _UINT32_(119)
#define MUX_PD23A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PD23A_EIC_EXTINT7                   ((PIN_PD23A_EIC_EXTINT7 << 16) | MUX_PD23A_EIC_EXTINT7)
#define PORT_PD23A_EIC_EXTINT7                     (_UINT32_(1) << 23)
#define PIN_PD23A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PD23 External Interrupt Line */

#define PIN_PE07A_EIC_EXTINT7                      _UINT32_(135)
#define MUX_PE07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PE07A_EIC_EXTINT7                   ((PIN_PE07A_EIC_EXTINT7 << 16) | MUX_PE07A_EIC_EXTINT7)
#define PORT_PE07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PE07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PE07 External Interrupt Line */

#define PIN_PF07A_EIC_EXTINT7                      _UINT32_(167)
#define MUX_PF07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PF07A_EIC_EXTINT7                   ((PIN_PF07A_EIC_EXTINT7 << 16) | MUX_PF07A_EIC_EXTINT7)
#define PORT_PF07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PF07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PF07 External Interrupt Line */

#define PIN_PG07A_EIC_EXTINT7                      _UINT32_(199)
#define MUX_PG07A_EIC_EXTINT7                      _UINT32_(0) 
#define PINMUX_PG07A_EIC_EXTINT7                   ((PIN_PG07A_EIC_EXTINT7 << 16) | MUX_PG07A_EIC_EXTINT7)
#define PORT_PG07A_EIC_EXTINT7                     (_UINT32_(1) << 7)
#define PIN_PG07A_EIC_EXTINT_NUM                   _UINT32_(7)  /* EIC signal: PIN_PG07 External Interrupt Line */

#define PIN_PA08A_EIC_EXTINT8                      _UINT32_(8) 
#define MUX_PA08A_EIC_EXTINT8                      _UINT32_(0) 
#define PINMUX_PA08A_EIC_EXTINT8                   ((PIN_PA08A_EIC_EXTINT8 << 16) | MUX_PA08A_EIC_EXTINT8)
#define PORT_PA08A_EIC_EXTINT8                     (_UINT32_(1) << 8)
#define PIN_PA08A_EIC_EXTINT_NUM                   _UINT32_(8)  /* EIC signal: PIN_PA08 External Interrupt Line */

#define PIN_PA24A_EIC_EXTINT8                      _UINT32_(24)
#define MUX_PA24A_EIC_EXTINT8                      _UINT32_(0) 
#define PINMUX_PA24A_EIC_EXTINT8                   ((PIN_PA24A_EIC_EXTINT8 << 16) | MUX_PA24A_EIC_EXTINT8)
#define PORT_PA24A_EIC_EXTINT8                     (_UINT32_(1) << 24)
#define PIN_PA24A_EIC_EXTINT_NUM                   _UINT32_(8)  /* EIC signal: PIN_PA24 External Interrupt Line */

