Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/pio/pic32cz8110ca80208.h
#define PIN_PD09A_EIC_EXTINT9                      _UINT32_(105)
#define MUX_PD09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PD09A_EIC_EXTINT9                   ((PIN_PD09A_EIC_EXTINT9 << 16) | MUX_PD09A_EIC_EXTINT9)
#define PORT_PD09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PD09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PD09 External Interrupt Line */

#define PIN_PD25A_EIC_EXTINT9                      _UINT32_(121)
#define MUX_PD25A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PD25A_EIC_EXTINT9                   ((PIN_PD25A_EIC_EXTINT9 << 16) | MUX_PD25A_EIC_EXTINT9)
#define PORT_PD25A_EIC_EXTINT9                     (_UINT32_(1) << 25)
#define PIN_PD25A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PD25 External Interrupt Line */

#define PIN_PE09A_EIC_EXTINT9                      _UINT32_(137)
#define MUX_PE09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PE09A_EIC_EXTINT9                   ((PIN_PE09A_EIC_EXTINT9 << 16) | MUX_PE09A_EIC_EXTINT9)
#define PORT_PE09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PE09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PE09 External Interrupt Line */

#define PIN_PG09A_EIC_EXTINT9                      _UINT32_(201)
#define MUX_PG09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PG09A_EIC_EXTINT9                   ((PIN_PG09A_EIC_EXTINT9 << 16) | MUX_PG09A_EIC_EXTINT9)
#define PORT_PG09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PG09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PG09 External Interrupt Line */

#define PIN_PA10A_EIC_EXTINT10                     _UINT32_(10)
#define MUX_PA10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PA10A_EIC_EXTINT10                  ((PIN_PA10A_EIC_EXTINT10 << 16) | MUX_PA10A_EIC_EXTINT10)
#define PORT_PA10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PA10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PA10 External Interrupt Line */

#define PIN_PA26A_EIC_EXTINT10                     _UINT32_(26)
#define MUX_PA26A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PA26A_EIC_EXTINT10                  ((PIN_PA26A_EIC_EXTINT10 << 16) | MUX_PA26A_EIC_EXTINT10)
#define PORT_PA26A_EIC_EXTINT10                    (_UINT32_(1) << 26)
#define PIN_PA26A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PA26 External Interrupt Line */

#define PIN_PB10A_EIC_EXTINT10                     _UINT32_(42)
#define MUX_PB10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PB10A_EIC_EXTINT10                  ((PIN_PB10A_EIC_EXTINT10 << 16) | MUX_PB10A_EIC_EXTINT10)
#define PORT_PB10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PB10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PB10 External Interrupt Line */

#define PIN_PB26A_EIC_EXTINT10                     _UINT32_(58)
#define MUX_PB26A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PB26A_EIC_EXTINT10                  ((PIN_PB26A_EIC_EXTINT10 << 16) | MUX_PB26A_EIC_EXTINT10)
#define PORT_PB26A_EIC_EXTINT10                    (_UINT32_(1) << 26)
#define PIN_PB26A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PB26 External Interrupt Line */

#define PIN_PC10A_EIC_EXTINT10                     _UINT32_(74)
#define MUX_PC10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PC10A_EIC_EXTINT10                  ((PIN_PC10A_EIC_EXTINT10 << 16) | MUX_PC10A_EIC_EXTINT10)
#define PORT_PC10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PC10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PC10 External Interrupt Line */

#define PIN_PC26A_EIC_EXTINT10                     _UINT32_(90)
#define MUX_PC26A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PC26A_EIC_EXTINT10                  ((PIN_PC26A_EIC_EXTINT10 << 16) | MUX_PC26A_EIC_EXTINT10)
#define PORT_PC26A_EIC_EXTINT10                    (_UINT32_(1) << 26)
#define PIN_PC26A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PC26 External Interrupt Line */

#define PIN_PD10A_EIC_EXTINT10                     _UINT32_(106)
#define MUX_PD10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PD10A_EIC_EXTINT10                  ((PIN_PD10A_EIC_EXTINT10 << 16) | MUX_PD10A_EIC_EXTINT10)
#define PORT_PD10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PD10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PD10 External Interrupt Line */

#define PIN_PD26A_EIC_EXTINT10                     _UINT32_(122)
#define MUX_PD26A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PD26A_EIC_EXTINT10                  ((PIN_PD26A_EIC_EXTINT10 << 16) | MUX_PD26A_EIC_EXTINT10)
#define PORT_PD26A_EIC_EXTINT10                    (_UINT32_(1) << 26)
#define PIN_PD26A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PD26 External Interrupt Line */

#define PIN_PE10A_EIC_EXTINT10                     _UINT32_(138)
#define MUX_PE10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PE10A_EIC_EXTINT10                  ((PIN_PE10A_EIC_EXTINT10 << 16) | MUX_PE10A_EIC_EXTINT10)
#define PORT_PE10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PE10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PE10 External Interrupt Line */

#define PIN_PG10A_EIC_EXTINT10                     _UINT32_(202)
#define MUX_PG10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PG10A_EIC_EXTINT10                  ((PIN_PG10A_EIC_EXTINT10 << 16) | MUX_PG10A_EIC_EXTINT10)
#define PORT_PG10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PG10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PG10 External Interrupt Line */

#define PIN_PA11A_EIC_EXTINT11                     _UINT32_(11)
#define MUX_PA11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PA11A_EIC_EXTINT11                  ((PIN_PA11A_EIC_EXTINT11 << 16) | MUX_PA11A_EIC_EXTINT11)
#define PORT_PA11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PA11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PA11 External Interrupt Line */

#define PIN_PA27A_EIC_EXTINT11                     _UINT32_(27)
#define MUX_PA27A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PA27A_EIC_EXTINT11                  ((PIN_PA27A_EIC_EXTINT11 << 16) | MUX_PA27A_EIC_EXTINT11)
#define PORT_PA27A_EIC_EXTINT11                    (_UINT32_(1) << 27)
#define PIN_PA27A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PA27 External Interrupt Line */

#define PIN_PB11A_EIC_EXTINT11                     _UINT32_(43)
#define MUX_PB11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PB11A_EIC_EXTINT11                  ((PIN_PB11A_EIC_EXTINT11 << 16) | MUX_PB11A_EIC_EXTINT11)
#define PORT_PB11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PB11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PB11 External Interrupt Line */

