Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/pio/pic32cz8110ca80208.h
#define PIN_PB29P_PTC_DRV20                        _UINT32_(61)
#define MUX_PB29P_PTC_DRV20                        _UINT32_(15)
#define PINMUX_PB29P_PTC_DRV20                     ((PIN_PB29P_PTC_DRV20 << 16) | MUX_PB29P_PTC_DRV20)
#define PORT_PB29P_PTC_DRV20                       (_UINT32_(1) << 29)

#define PIN_PF05P_PTC_DRV21                        _UINT32_(165)
#define MUX_PF05P_PTC_DRV21                        _UINT32_(15)
#define PINMUX_PF05P_PTC_DRV21                     ((PIN_PF05P_PTC_DRV21 << 16) | MUX_PF05P_PTC_DRV21)
#define PORT_PF05P_PTC_DRV21                       (_UINT32_(1) << 5)

#define PIN_PB28P_PTC_DRV22                        _UINT32_(60)
#define MUX_PB28P_PTC_DRV22                        _UINT32_(15)
#define PINMUX_PB28P_PTC_DRV22                     ((PIN_PB28P_PTC_DRV22 << 16) | MUX_PB28P_PTC_DRV22)
#define PORT_PB28P_PTC_DRV22                       (_UINT32_(1) << 28)

#define PIN_PB27P_PTC_DRV23                        _UINT32_(59)
#define MUX_PB27P_PTC_DRV23                        _UINT32_(15)
#define PINMUX_PB27P_PTC_DRV23                     ((PIN_PB27P_PTC_DRV23 << 16) | MUX_PB27P_PTC_DRV23)
#define PORT_PB27P_PTC_DRV23                       (_UINT32_(1) << 27)

#define PIN_PF08P_PTC_DRV24                        _UINT32_(168)
#define MUX_PF08P_PTC_DRV24                        _UINT32_(15)
#define PINMUX_PF08P_PTC_DRV24                     ((PIN_PF08P_PTC_DRV24 << 16) | MUX_PF08P_PTC_DRV24)
#define PORT_PF08P_PTC_DRV24                       (_UINT32_(1) << 8)

#define PIN_PF07P_PTC_DRV25                        _UINT32_(167)
#define MUX_PF07P_PTC_DRV25                        _UINT32_(15)
#define PINMUX_PF07P_PTC_DRV25                     ((PIN_PF07P_PTC_DRV25 << 16) | MUX_PF07P_PTC_DRV25)
#define PORT_PF07P_PTC_DRV25                       (_UINT32_(1) << 7)

#define PIN_PF06P_PTC_DRV26                        _UINT32_(166)
#define MUX_PF06P_PTC_DRV26                        _UINT32_(15)
#define PINMUX_PF06P_PTC_DRV26                     ((PIN_PF06P_PTC_DRV26 << 16) | MUX_PF06P_PTC_DRV26)
#define PORT_PF06P_PTC_DRV26                       (_UINT32_(1) << 6)

#define PIN_PF04P_PTC_DRV27                        _UINT32_(164)
#define MUX_PF04P_PTC_DRV27                        _UINT32_(15)
#define PINMUX_PF04P_PTC_DRV27                     ((PIN_PF04P_PTC_DRV27 << 16) | MUX_PF04P_PTC_DRV27)
#define PORT_PF04P_PTC_DRV27                       (_UINT32_(1) << 4)

#define PIN_PF03P_PTC_DRV28                        _UINT32_(163)
#define MUX_PF03P_PTC_DRV28                        _UINT32_(15)
#define PINMUX_PF03P_PTC_DRV28                     ((PIN_PF03P_PTC_DRV28 << 16) | MUX_PF03P_PTC_DRV28)
#define PORT_PF03P_PTC_DRV28                       (_UINT32_(1) << 3)

#define PIN_PF02P_PTC_DRV29                        _UINT32_(162)
#define MUX_PF02P_PTC_DRV29                        _UINT32_(15)
#define PINMUX_PF02P_PTC_DRV29                     ((PIN_PF02P_PTC_DRV29 << 16) | MUX_PF02P_PTC_DRV29)
#define PORT_PF02P_PTC_DRV29                       (_UINT32_(1) << 2)

#define PIN_PF00P_PTC_DRV30                        _UINT32_(160)
#define MUX_PF00P_PTC_DRV30                        _UINT32_(15)
#define PINMUX_PF00P_PTC_DRV30                     ((PIN_PF00P_PTC_DRV30 << 16) | MUX_PF00P_PTC_DRV30)
#define PORT_PF00P_PTC_DRV30                       (_UINT32_(1) << 0)

#define PIN_PF01P_PTC_DRV31                        _UINT32_(161)
#define MUX_PF01P_PTC_DRV31                        _UINT32_(15)
#define PINMUX_PF01P_PTC_DRV31                     ((PIN_PF01P_PTC_DRV31 << 16) | MUX_PF01P_PTC_DRV31)
#define PORT_PF01P_PTC_DRV31                       (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_ECI0                         _UINT32_(66)
#define MUX_PC02P_PTC_ECI0                         _UINT32_(15)
#define PINMUX_PC02P_PTC_ECI0                      ((PIN_PC02P_PTC_ECI0 << 16) | MUX_PC02P_PTC_ECI0)
#define PORT_PC02P_PTC_ECI0                        (_UINT32_(1) << 2)

#define PIN_PC03P_PTC_ECI1                         _UINT32_(67)
#define MUX_PC03P_PTC_ECI1                         _UINT32_(15)
#define PINMUX_PC03P_PTC_ECI1                      ((PIN_PC03P_PTC_ECI1 << 16) | MUX_PC03P_PTC_ECI1)
#define PORT_PC03P_PTC_ECI1                        (_UINT32_(1) << 3)

/* ========== PORT definition for SDMMC0 peripheral ========== */
#define PIN_PC15I_SDMMC0_SDCD                      _UINT32_(79)
#define MUX_PC15I_SDMMC0_SDCD                      _UINT32_(8) 
#define PINMUX_PC15I_SDMMC0_SDCD                   ((PIN_PC15I_SDMMC0_SDCD << 16) | MUX_PC15I_SDMMC0_SDCD)
#define PORT_PC15I_SDMMC0_SDCD                     (_UINT32_(1) << 15)

#define PIN_PC08I_SDMMC0_SDCK                      _UINT32_(72)
#define MUX_PC08I_SDMMC0_SDCK                      _UINT32_(8) 
#define PINMUX_PC08I_SDMMC0_SDCK                   ((PIN_PC08I_SDMMC0_SDCK << 16) | MUX_PC08I_SDMMC0_SDCK)
#define PORT_PC08I_SDMMC0_SDCK                     (_UINT32_(1) << 8)

#define PIN_PC13I_SDMMC0_SDCMD                     _UINT32_(77)
#define MUX_PC13I_SDMMC0_SDCMD                     _UINT32_(8) 
#define PINMUX_PC13I_SDMMC0_SDCMD                  ((PIN_PC13I_SDMMC0_SDCMD << 16) | MUX_PC13I_SDMMC0_SDCMD)
#define PORT_PC13I_SDMMC0_SDCMD                    (_UINT32_(1) << 13)

#define PIN_PC09I_SDMMC0_SDDAT0                    _UINT32_(73)
#define MUX_PC09I_SDMMC0_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC09I_SDMMC0_SDDAT0                 ((PIN_PC09I_SDMMC0_SDDAT0 << 16) | MUX_PC09I_SDMMC0_SDDAT0)
#define PORT_PC09I_SDMMC0_SDDAT0                   (_UINT32_(1) << 9)

#define PIN_PC10I_SDMMC0_SDDAT1                    _UINT32_(74)
#define MUX_PC10I_SDMMC0_SDDAT1                    _UINT32_(8) 
#define PINMUX_PC10I_SDMMC0_SDDAT1                 ((PIN_PC10I_SDMMC0_SDDAT1 << 16) | MUX_PC10I_SDMMC0_SDDAT1)
#define PORT_PC10I_SDMMC0_SDDAT1                   (_UINT32_(1) << 10)

#define PIN_PC11I_SDMMC0_SDDAT2                    _UINT32_(75)
#define MUX_PC11I_SDMMC0_SDDAT2                    _UINT32_(8) 
#define PINMUX_PC11I_SDMMC0_SDDAT2                 ((PIN_PC11I_SDMMC0_SDDAT2 << 16) | MUX_PC11I_SDMMC0_SDDAT2)
#define PORT_PC11I_SDMMC0_SDDAT2                   (_UINT32_(1) << 11)

#define PIN_PC12I_SDMMC0_SDDAT3                    _UINT32_(76)
#define MUX_PC12I_SDMMC0_SDDAT3                    _UINT32_(8) 
#define PINMUX_PC12I_SDMMC0_SDDAT3                 ((PIN_PC12I_SDMMC0_SDDAT3 << 16) | MUX_PC12I_SDMMC0_SDDAT3)
#define PORT_PC12I_SDMMC0_SDDAT3                   (_UINT32_(1) << 12)

#define PIN_PC14I_SDMMC0_SDWP                      _UINT32_(78)
#define MUX_PC14I_SDMMC0_SDWP                      _UINT32_(8) 
#define PINMUX_PC14I_SDMMC0_SDWP                   ((PIN_PC14I_SDMMC0_SDWP << 16) | MUX_PC14I_SDMMC0_SDWP)
#define PORT_PC14I_SDMMC0_SDWP                     (_UINT32_(1) << 14)

