Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/pio/pic32cz8110ca80208.h
#define PIN_PC22F_TCC6_WO1                         _UINT32_(86)
#define MUX_PC22F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC22F_TCC6_WO1                      ((PIN_PC22F_TCC6_WO1 << 16) | MUX_PC22F_TCC6_WO1)
#define PORT_PC22F_TCC6_WO1                        (_UINT32_(1) << 22)

/* ========== PORT definition for TCC7 peripheral ========== */
#define PIN_PA22F_TCC7_WO0                         _UINT32_(22)
#define MUX_PA22F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PA22F_TCC7_WO0                      ((PIN_PA22F_TCC7_WO0 << 16) | MUX_PA22F_TCC7_WO0)
#define PORT_PA22F_TCC7_WO0                        (_UINT32_(1) << 22)

#define PIN_PD08F_TCC7_WO0                         _UINT32_(104)
#define MUX_PD08F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PD08F_TCC7_WO0                      ((PIN_PD08F_TCC7_WO0 << 16) | MUX_PD08F_TCC7_WO0)
#define PORT_PD08F_TCC7_WO0                        (_UINT32_(1) << 8)

#define PIN_PA23F_TCC7_WO1                         _UINT32_(23)
#define MUX_PA23F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PA23F_TCC7_WO1                      ((PIN_PA23F_TCC7_WO1 << 16) | MUX_PA23F_TCC7_WO1)
#define PORT_PA23F_TCC7_WO1                        (_UINT32_(1) << 23)

#define PIN_PD07F_TCC7_WO1                         _UINT32_(103)
#define MUX_PD07F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PD07F_TCC7_WO1                      ((PIN_PD07F_TCC7_WO1 << 16) | MUX_PD07F_TCC7_WO1)
#define PORT_PD07F_TCC7_WO1                        (_UINT32_(1) << 7)

/* ========== PORT definition for TCC8 peripheral ========== */
#define PIN_PA21F_TCC8_WO0                         _UINT32_(21)
#define MUX_PA21F_TCC8_WO0                         _UINT32_(5) 
#define PINMUX_PA21F_TCC8_WO0                      ((PIN_PA21F_TCC8_WO0 << 16) | MUX_PA21F_TCC8_WO0)
#define PORT_PA21F_TCC8_WO0                        (_UINT32_(1) << 21)

#define PIN_PC14F_TCC8_WO0                         _UINT32_(78)
#define MUX_PC14F_TCC8_WO0                         _UINT32_(5) 
#define PINMUX_PC14F_TCC8_WO0                      ((PIN_PC14F_TCC8_WO0 << 16) | MUX_PC14F_TCC8_WO0)
#define PORT_PC14F_TCC8_WO0                        (_UINT32_(1) << 14)

#define PIN_PC15F_TCC8_WO1                         _UINT32_(79)
#define MUX_PC15F_TCC8_WO1                         _UINT32_(5) 
#define PINMUX_PC15F_TCC8_WO1                      ((PIN_PC15F_TCC8_WO1 << 16) | MUX_PC15F_TCC8_WO1)
#define PORT_PC15F_TCC8_WO1                        (_UINT32_(1) << 15)

#define PIN_PD23F_TCC8_WO1                         _UINT32_(119)
#define MUX_PD23F_TCC8_WO1                         _UINT32_(5) 
#define PINMUX_PD23F_TCC8_WO1                      ((PIN_PD23F_TCC8_WO1 << 16) | MUX_PD23F_TCC8_WO1)
#define PORT_PD23F_TCC8_WO1                        (_UINT32_(1) << 23)

/* ========== PORT definition for TCC9 peripheral ========== */
#define PIN_PD04F_TCC9_WO0                         _UINT32_(100)
#define MUX_PD04F_TCC9_WO0                         _UINT32_(5) 
#define PINMUX_PD04F_TCC9_WO0                      ((PIN_PD04F_TCC9_WO0 << 16) | MUX_PD04F_TCC9_WO0)
#define PORT_PD04F_TCC9_WO0                        (_UINT32_(1) << 4)

#define PIN_PG05F_TCC9_WO0                         _UINT32_(197)
#define MUX_PG05F_TCC9_WO0                         _UINT32_(5) 
#define PINMUX_PG05F_TCC9_WO0                      ((PIN_PG05F_TCC9_WO0 << 16) | MUX_PG05F_TCC9_WO0)
#define PORT_PG05F_TCC9_WO0                        (_UINT32_(1) << 5)

#define PIN_PD05F_TCC9_WO1                         _UINT32_(101)
#define MUX_PD05F_TCC9_WO1                         _UINT32_(5) 
#define PINMUX_PD05F_TCC9_WO1                      ((PIN_PD05F_TCC9_WO1 << 16) | MUX_PD05F_TCC9_WO1)
#define PORT_PD05F_TCC9_WO1                        (_UINT32_(1) << 5)

#define PIN_PG06F_TCC9_WO1                         _UINT32_(198)
#define MUX_PG06F_TCC9_WO1                         _UINT32_(5) 
#define PINMUX_PG06F_TCC9_WO1                      ((PIN_PG06F_TCC9_WO1 << 16) | MUX_PG06F_TCC9_WO1)
#define PORT_PG06F_TCC9_WO1                        (_UINT32_(1) << 6)

#define PIN_PD06F_TCC9_WO2                         _UINT32_(102)
#define MUX_PD06F_TCC9_WO2                         _UINT32_(5) 
#define PINMUX_PD06F_TCC9_WO2                      ((PIN_PD06F_TCC9_WO2 << 16) | MUX_PD06F_TCC9_WO2)
#define PORT_PD06F_TCC9_WO2                        (_UINT32_(1) << 6)

#define PIN_PG07F_TCC9_WO2                         _UINT32_(199)
#define MUX_PG07F_TCC9_WO2                         _UINT32_(5) 
#define PINMUX_PG07F_TCC9_WO2                      ((PIN_PG07F_TCC9_WO2 << 16) | MUX_PG07F_TCC9_WO2)
#define PORT_PG07F_TCC9_WO2                        (_UINT32_(1) << 7)

#define PIN_PD03F_TCC9_WO3                         _UINT32_(99)
#define MUX_PD03F_TCC9_WO3                         _UINT32_(5) 
#define PINMUX_PD03F_TCC9_WO3                      ((PIN_PD03F_TCC9_WO3 << 16) | MUX_PD03F_TCC9_WO3)
#define PORT_PD03F_TCC9_WO3                        (_UINT32_(1) << 3)

#define PIN_PG09F_TCC9_WO3                         _UINT32_(201)
#define MUX_PG09F_TCC9_WO3                         _UINT32_(5) 
#define PINMUX_PG09F_TCC9_WO3                      ((PIN_PG09F_TCC9_WO3 << 16) | MUX_PG09F_TCC9_WO3)
#define PORT_PG09F_TCC9_WO3                        (_UINT32_(1) << 9)

#define PIN_PD02F_TCC9_WO4                         _UINT32_(98)
#define MUX_PD02F_TCC9_WO4                         _UINT32_(5) 
#define PINMUX_PD02F_TCC9_WO4                      ((PIN_PD02F_TCC9_WO4 << 16) | MUX_PD02F_TCC9_WO4)
#define PORT_PD02F_TCC9_WO4                        (_UINT32_(1) << 2)

#define PIN_PG10F_TCC9_WO4                         _UINT32_(202)
#define MUX_PG10F_TCC9_WO4                         _UINT32_(5) 
#define PINMUX_PG10F_TCC9_WO4                      ((PIN_PG10F_TCC9_WO4 << 16) | MUX_PG10F_TCC9_WO4)
#define PORT_PG10F_TCC9_WO4                        (_UINT32_(1) << 10)

#define PIN_PC20F_TCC9_WO5                         _UINT32_(84)
#define MUX_PC20F_TCC9_WO5                         _UINT32_(5) 
#define PINMUX_PC20F_TCC9_WO5                      ((PIN_PC20F_TCC9_WO5 << 16) | MUX_PC20F_TCC9_WO5)
#define PORT_PC20F_TCC9_WO5                        (_UINT32_(1) << 20)

#define PIN_PG11F_TCC9_WO5                         _UINT32_(203)
#define MUX_PG11F_TCC9_WO5                         _UINT32_(5) 
#define PINMUX_PG11F_TCC9_WO5                      ((PIN_PG11F_TCC9_WO5 << 16) | MUX_PG11F_TCC9_WO5)
#define PORT_PG11F_TCC9_WO5                        (_UINT32_(1) << 11)



#endif /* _PIC32CZ8110CA80208_GPIO_H_ */

